stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_ll_lpuart.h
/**
  * @brief  Set the trigger polarity
  * @rmtoll AUTOCR        TRIGPOL     LL_LPUART_SetTriggerPolarity
  * @param  LPUARTx LPUART Instance
  * @param  Polarity This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_TRIG_POLARITY_RISING
  *         @arg @ref LL_LPUART_TRIG_POLARITY_FALLING
  * @retval None
  */
__STATIC_INLINE void LL_LPUART_SetTriggerPolarity(USART_TypeDef *LPUARTx, uint32_t Polarity)
{
  MODIFY_REG(LPUARTx->AUTOCR, USART_AUTOCR_TRIGPOL, Polarity);
}

/**
  * @brief  Get the trigger polarity
  * @rmtoll AUTOCR        TRIGPOL     LL_LPUART_GetTriggerPolarity
  * @param  LPUARTx LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_TRIG_POLARITY_RISING
  *         @arg @ref LL_LPUART_TRIG_POLARITY_FALLING
  */
__STATIC_INLINE uint32_t LL_LPUART_GetTriggerPolarity(const USART_TypeDef *LPUARTx)
{
  return (uint32_t)(READ_BIT(LPUARTx->AUTOCR, USART_AUTOCR_TRIGPOL));
}

/**
  * @brief  Set the selected trigger
  * @rmtoll AUTOCR        TRIGSEL     LL_LPUART_SetSelectedTrigger
  * @param  LPUARTx LPUART Instance
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref  LL_LPUART_GPDMA1_CH0_TCF_TRG
  *         @arg @ref  LL_LPUART_GPDMA1_CH1_TCF_TRG
  *         @arg @ref  LL_LPUART_GPDMA1_CH2_TCF_TRG
  *         @arg @ref  LL_LPUART_GPDMA1_CH3_TCF_TRG
  *         @arg @ref  LL_LPUART_EXTI_LINE6_TRG
  *         @arg @ref  LL_LPUART_EXTI_LINE8_TRG
  *         @arg @ref  LL_LPUART_LPTIM1_OUT_TRG
  *         @arg @ref  LL_LPUART_COMP1_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_LPUART_COMP2_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_LPUART_RTC_ALRA_TRG
  *         @arg @ref  LL_LPUART_RTC_WUT_TRG
  * @retval None
  */
__STATIC_INLINE void LL_LPUART_SetSelectedTrigger(USART_TypeDef *LPUARTx, uint32_t Trigger)
{
  MODIFY_REG(LPUARTx->AUTOCR, USART_AUTOCR_TRIGSEL, (Trigger << USART_AUTOCR_TRIGSEL_Pos));
}

/**
  * @brief  Get the selected trigger
  * @rmtoll AUTOCR        TRIGSEL     LL_LPUART_GetSelectedTrigger
  * @param  LPUARTx LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref  LL_LPUART_GPDMA1_CH0_TCF_TRG
  *         @arg @ref  LL_LPUART_GPDMA1_CH1_TCF_TRG
  *         @arg @ref  LL_LPUART_GPDMA1_CH2_TCF_TRG
  *         @arg @ref  LL_LPUART_GPDMA1_CH3_TCF_TRG
  *         @arg @ref  LL_LPUART_EXTI_LINE6_TRG
  *         @arg @ref  LL_LPUART_EXTI_LINE8_TRG
  *         @arg @ref  LL_LPUART_LPTIM1_OUT_TRG
  *         @arg @ref  LL_LPUART_COMP1_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_LPUART_COMP2_OUT_TRG (not available on all devices)
  *         @arg @ref  LL_LPUART_RTC_ALRA_TRG
  *         @arg @ref  LL_LPUART_RTC_WUT_TRG
  */
__STATIC_INLINE uint32_t LL_LPUART_GetSelectedTrigger(const USART_TypeDef *LPUARTx)
{
  return (uint32_t)((READ_BIT(LPUARTx->AUTOCR, USART_AUTOCR_TRIGSEL) >> USART_AUTOCR_TRIGSEL_Pos));
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup LPUART_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_LPUART_DeInit(const USART_TypeDef *LPUARTx);
ErrorStatus LL_LPUART_Init(USART_TypeDef *LPUARTx, const LL_LPUART_InitTypeDef *LPUART_InitStruct);
void        LL_LPUART_StructInit(LL_LPUART_InitTypeDef *LPUART_InitStruct);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LPUART1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WBAxx_LL_LPUART_H */
